{
    "translation": {
        "about": {
            "header": "Jonas König",
            "greeting": "Ahoj {{name}}!",
            "greetingNoName": "Dobrý den!",
            "greetingText": "Jmenuji se Jonas a tyto webové stránky jsem vytvořil jako jakousi digitální vizitku. Šachovnice je jen taková interaktivní zábava. Pozice šachových figurek jsou uloženy v adrese URL, takže můžete provést tah a poslat odkaz kamarádovi. 🤗",
            "tab": "O mně",
            "exp": "Zkušenosti",
            "expText": "Mám profesionální zkušenosti s TypeScriptem, Reactem a mnoha dalšími technologiemi pro vývoj front-endu. Během studia informatiky jsem se naučil populární programovací jazyky, jako je Java a Python. Musel jsem ale také posunout svůj pohled na učení více výklenkových technologií, jako je Haskell.",
            "cv": "Vzdělávání & C.V.",
            "cs": "Informatiky",
            "bufdi": "Dobrovolná služba",
            "today": "dnes"
        },
        "game": {
            "header": "Šachy",
            "tab": "Přehrát",
            "player1": "Hráč černá",
            "player2": "Hráč bílé"
        },
        "settings": {
            "header": "Nastavení",
            "tab": "Nastavení",
            "appearance": "Vzhled",
            "lang": "Vyberte jazyk",
            "langText": "I lived in Prague for 6 months and it was a second home to me ❤. My czech skills are limited to what I learned on Duolingo, so some of the Czech texts were translated using AI. I apologize if there are any errors. Please let me know.",
            "gameText": "Stav šachovnice je uložen v adrese URL. Proto můžete svou šachovnici sdílet s kamarádem a on uvidí přesně to, co vy.",
            "gameReset": "Resetovací Šachovnice",
            "namesText": "Pokud chcete, můžete zadat své jméno a jméno svých přátel, které se zobrazí vedle tabule.",
            "queensText": "Vaše hra už nějakou dobu pokračuje? Vždy můžete náhodně přidat další královny.",
            "addQueens": "Přidat další královny (experimentální)"
        }
    }
}